'use strict';Object.defineProperty(exports,'__esModule',{value:true});/********************************************************************************************************************
 * 객체 복사
 * @param value 복사할 객체
 * @returns 복사된 객체
 * ******************************************************************************************************************/
function copy(value) {
    return JSON.parse(JSON.stringify(value));
}/********************************************************************************************************************
 * 구현
 * ******************************************************************************************************************/
function lv(label, value, other) {
    return Object.assign(Object.assign({}, other), { label, value });
}/********************************************************************************************************************
 * 구현
 * ******************************************************************************************************************/
function vl(value, label, other) {
    return Object.assign(Object.assign({}, other), { value, label });
}var index = {
    copy,
    lv,
    vl,
};exports.copy=copy;exports.default=index;exports.lv=lv;exports.vl=vl;